<a href="https://colab.research.google.com/github/Dityath/kNN/blob/main/K_Nearest_Neighbor.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# K-Nearest Neighbor Assignment
IF-43-INT

- Ditya Athallah
- Pernanda Arya BhagasKara S M
- Rifaldy Bintang Ramadhan

### Import all data and library

In [ ]:
import pandas as pd
from math import sqrt

You can edit the training data in google spread [here](https://docs.google.com/spreadsheets/d/1qY2Pxbb2lCNy3WsdJ_09dJodustHinEGRy-847WFHr8/edit?usp=sharing)

Dont forget to save the sheet and run all again after editing

In [ ]:
data = pd.read_excel("https://github.com/Dityath/kNN/blob/main/mobil.xls?raw=true")
raw_training_data = pd.read_csv("https://docs.google.com/spreadsheets/d/1qY2Pxbb2lCNy3WsdJ_09dJodustHinEGRy-847WFHr8/export?format=csv")

#### Dataset

In [ ]:
data

              Nama Mobil  Ukuran  ...  Kecepatan  Harga (Ratus Juta)
0            Toyota Agya       4  ...          6                1.00
1          Daihatsu Alya       4  ...          6                1.10
2          Toyota Avanza       6  ...          6                2.00
3         Daihatsu Xenia       6  ...          6                1.75
4                Xpander       7  ...          7                2.25
5                 Livina       7  ...          7                2.10
6                Karimun       3  ...          5                1.20
7          Toyota Innova       8  ...          7                4.00
8                Alphard       9  ...          8               10.00
9            Toyota Vios       5  ...          8                2.50
10            Honda City       5  ...          8                2.70
11          Toyota Hiace      10  ...          6                5.00
12       Toyota Fortuner       9  ...          8                5.00
13           Toyota Foxy       9  ...          7                5.50
14  Toyota Corolla Altis       5  ...          9                6.00
15         Suzuki Ertiga       7  ...          7                2.30
16          Suzuki Carry       7  ...          5                0.80

[17 rows x 6 columns]

#### Training Data

From Input

In [ ]:
raw_training_data

   Ukuran  Kenyamanan  Irit  Kecepatan  Harga (Ratus Juta)
0       3           5     4          4                   1

### Pre-processing Data

In [ ]:
training_data = [raw_training_data['Ukuran'][0], raw_training_data['Kenyamanan'][0], raw_training_data['Irit'][0], raw_training_data['Kecepatan'][0], raw_training_data['Harga (Ratus Juta)'][0]]
data.isna().sum()
df = data.drop(["Nama Mobil"], axis = 1)

#### Formula

In [ ]:
def manhattanFormula(x, y):
  return sum([abs(x[i] - y[i]) for i in range(len(x))])

def euclideanFormula(x, y):
  return sqrt(sum([(x[i] - y[i]) ** 2 for i in range(len(x))]))

def minkowskiFormula(x, y, r):
  return sum([abs(x[i] - y[i]) ** r for i in range(len(x))]) ** (1./ r)

def supremumFormula(x, y):
  return max([abs(x[i] - y[i]) for i in range(len(x))])

### Classification

#### Manhattan

In [ ]:
def manhattan(val):
  manhattan_distance = []
  df_list = df.values

  for x in df_list:
    manhattan_distance.append(manhattanFormula(x, training_data))

  data["manhattan"] = manhattan_distance
  manhattan_sorted = data.sort_values(by=['manhattan'])[:val]

  return manhattan_sorted

#### Euclidean

In [ ]:
def euclidean(val):
  euclidean_distance = []
  df_list = df.values

  for x in df_list:
    euclidean_distance.append(euclideanFormula(x, training_data))

  data["euclidean"] = euclidean_distance
  euclidean_sorted = data.sort_values(by=['euclidean'])[:val]

  return euclidean_sorted

#### Minkowski

In [ ]:
def minkowski(val):
  minkowski_distance = []
  df_list = df.values

  for x in df_list:
    minkowski_distance.append(minkowskiFormula(x, training_data, 3))

  data["minkowski"] = minkowski_distance
  minkowski_sorted = data.sort_values(by=['minkowski'])[:val]

  return minkowski_sorted

#### Supremum

In [ ]:
def supremum(val):
  supremum_distance = []
  df_list = df.values

  for x in df_list:
    supremum_distance.append(supremumFormula(x, training_data))

  data["supremum"] = supremum_distance
  supremum_sorted = data.sort_values(by=['supremum'])[:val]

  return supremum_sorted

### Main

In [ ]:
size = 4

man = manhattan(size)
eu = euclidean(size)
min = minkowski(size)
sp = supremum(size)

#### Output
(To Excel)

In [ ]:
man.to_excel('recommend_manhattan.xls', index=False)
eu.to_excel('recommend_euclidean.xls', index=False)
min.to_excel('recommend_minkowski.xls', index=False)
sp.to_excel('recommend_supremum.xls', index=False)

print(man)
print(eu)
print(min)
print(sp)

       Nama Mobil  Ukuran  Kenyamanan  ...  Kecepatan  Harga (Ratus Juta)  manhattan
2   Toyota Avanza       6           5  ...          6                2.00       8.00
6         Karimun       3           4  ...          5                1.20       8.20
3  Daihatsu Xenia       6           4  ...          6                1.75       8.75
0     Toyota Agya       4           4  ...          6                1.00       9.00

[4 rows x 7 columns]
       Nama Mobil  Ukuran  Kenyamanan  ...  Harga (Ratus Juta)  manhattan  euclidean
2   Toyota Avanza       6           5  ...                2.00       8.00   4.242641
3  Daihatsu Xenia       6           4  ...                1.75       8.75   4.308422
0     Toyota Agya       4           4  ...                1.00       9.00   5.567764
1   Daihatsu Alya       4           3  ...                1.10      10.10   5.831809

[4 rows x 8 columns]
       Nama Mobil  Ukuran  Kenyamanan  ...  manhattan  euclidean  minkowski
2   Toyota Avanza       6           5  ...       8.00   4.242641   3.530348
3  Daihatsu Xenia       6           4  ...       8.75   4.308422   3.541596
5          Livina       7           7  ...      12.10   5.848932   4.767063
4         Xpander       7           7  ...      12.25   5.878988   4.776171

[4 rows x 9 columns]
       Nama Mobil  Ukuran  Kenyamanan  ...  euclidean  minkowski  supremum
2   Toyota Avanza       6           5  ...   4.242641   3.530348       3.0
3  Daihatsu Xenia       6           4  ...   4.308422   3.541596       3.0
4         Xpander       7           7  ...   5.878988   4.776171       4.0
5          Livina       7           7  ...   5.848932   4.767063       4.0

[4 rows x 10 columns]